Week 11 HW/Week11Practical/tests/artillery.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 100
scenarios:
  - flow:
      - post:
          url: "/toDos"
          json:
            title: "The Brotherhood of the Traveling Gucci Flip-Flop"
            description: "Follow the story of a group of brothers who all share single Gucci Flip-flop. Follow the riveting tale of their trials and tribulations through life, love, and brotherhood."
            completed: True
      - get: 
          url: "/toDos"